Terraform plan for __dev__
<details>
<summary>Plan: 3 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.core_auth0_jwt_client_credentials[0] must be replaced
-/+ resource "kubernetes_secret" "core_auth0_jwt_client_credentials" {
      ~ id   = "*********************" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "auth0-credentials"
          ~ namespace        = "ebo" -> "api-creds" # forces replacement
          ~ resource_version = "********" -> (known after apply)
          ~ uid              = "************************************" -> (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + path                       = (known after apply)
      + project                    = "ebo-dev-321910"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #370](https://github.com/ebomart/commerce-infrastructure/actions/runs/1626479452)